ИСПП/src/Documents/ЗаявкаПредприятия/ЗаявкаПредприятия.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаявкаПредприятия</name>
  <posting>Deny</posting>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Предприятие</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СпецификацияКДоговору</name>
    <type>
      <types>DocumentRef.СпецификацияКДоговору</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Enums/СтавкиНДС/СтавкиНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтавкиНДС</name>
  <enumValues>
    <name>НДС20</name>
    <comment>Ставка НДС 20%</comment>
  </enumValues>
  <enumValues>
    <name>НДС20_120</name>
    <comment>Расчетная ставка НДС 20/120</comment>
  </enumValues>
  <enumValues>
    <name>НДС18</name>
    <comment>Ставка НДС 18%</comment>
  </enumValues>
  <enumValues>
    <name>НДС18_118</name>
    <comment>Расчетная ставка НДС 18/118</comment>
  </enumValues>
  <enumValues>
    <name>НДС10</name>
    <comment>Ставка НДС 10%</comment>
  </enumValues>
  <enumValues>
    <name>НДС10_110</name>
    <comment>Расчетная ставка НДС 10/110</comment>
  </enumValues>
  <enumValues>
    <name>НДС0</name>
    <comment>Ставка НДС 0%</comment>
  </enumValues>
  <enumValues>
    <name>БезНДС</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Documents/ПоступлениеТоваров/ПоступлениеТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеТоваров</name>
  <basedOn>Document.СпецификацияКДоговору</basedOn>
  <registerRecords>AccumulationRegister.ИсполнениеПроектов</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ИсполнениеЗаявокПредприятий</registerRecords>
  <registerRecords>AccumulationRegister.ДвиженияНоменклатураДоходыРасходы</registerRecords>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.Закупки</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Гриф</name>
    <type>
      <types>CatalogRef.Грифы</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузоотправитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПриказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорГрузоотправителя</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПоставщику</name>
    <type>
      <types>DocumentRef.СпецификацияКДоговору</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НеИзменятьСерии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПриказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоступлениеПоЗаказу</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>EnumRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Центр</name>
    <type>
      <types>CatalogRef.Центры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>Количество в базовых единицах измерения</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияПартий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>CatalogRef.ПартииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураЗаказа</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Гриф</name>
      <type>
        <types>CatalogRef.Грифы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомиссии</name>
    <attributes>
      <name>ЧленКомиссии</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Председатель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Documents/ЗаявкаПредприятия/Forms/ФормаЗагрузкаИзExcel/Module.bsl
&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	Режим = РежимДиалогаВыбораФайла.Открытие;
    Диалог = Новый ДиалогВыбораФайла(Режим);
    Диалог.ПолноеИмяФайла = "";
    Диалог.МножественныйВыбор = Ложь;
	Фильтр = "Таблицы, *.xls*|*.xls*";
	Диалог.Фильтр = Фильтр;
    Диалог.Заголовок = "Укажите файл для чтения";
    Если Диалог.Выбрать() Тогда
        Файл = Диалог.ВыбранныеФайлы[0];
	Иначе
		Возврат;
    КонецЕсли;
    
	Попытка
		Excel = Новый COMОбъект("Excel.Application");
		Excel.WorkBooks.Open(Файл);
		ExcelЛист = Excel.Sheets(1);
	Исключение
		Excel = Неопределено;
		Сообщить("Ошибка обработки файла!");
		Возврат;
	КонецПопытки;
	
	Попытка
		
		ТаблицаНоменклатуры.Очистить();
		Версия = Лев(Excel.Version,Найти(Excel.Version,".")-1);
		НачальнаяКолонка    = 1;
	    НачальнаяСтрока     = 2;
	    Если Версия = "8" Тогда
	        //КонечнаяКолонка = ExcelЛист.Cells.CurrentRegion.Columns.Count;
	        КонечнаяСтрока  = ExcelЛист.Cells.CurrentRegion.Rows.Count;
	    Иначе
	        //КонечнаяКолонка = ExcelЛист.Cells.SpecialCells(11).Column;
	        КонечнаяСтрока  = ExcelЛист.Cells.SpecialCells(11).Row;
		Конецесли;
		КонечнаяКолонка = 7;
		
		ДиапазонДанных = ExcelЛист.Range(ExcelЛист.Cells(НачальнаяСтрока, НачальнаяКолонка), ExcelЛист.Cells(КонечнаяСтрока, КонечнаяКолонка));
	    СтрокДиапазона = ДиапазонДанных.Rows.Count;
		
		ДиапазонДанных = ДиапазонДанных.Value;
		
		//ДиапазонДанных = ДиапазонДанных.Value.Выгрузить();
		//
		//ПолучитьТаблицуЗначенийИзДиапазонаДанных(ДиапазонДанных, НачальнаяКолонка, КонечнаяКолонка);

			
		Для НомерСтроки = 1 По СтрокДиапазона Цикл
			
			Если ДиапазонДанных.GetValue(1, НомерСтроки) = Неопределено Тогда
				Продолжить;
			КонецЕсли;	
			
			Описание = СокрЛП(ДиапазонДанных.GetValue(2, НомерСтроки));
			Наименование = СокрЛП(ДиапазонДанных.GetValue(3, НомерСтроки));
			Количество = Число(СокрЛП(ДиапазонДанных.GetValue(5, НомерСтроки)));
			Производитель = СокрЛП(ДиапазонДанных.GetValue(4, НомерСтроки));
			
			НоваяСтрока = ТаблицаНоменклатуры.Добавить();			
			НоваяСтрока.Наименование = СокрЛП(Наименование);
			НоваяСтрока.Количество = Количество;
			НоваяСтрока.Описание = Описание;
			НоваяСтрока.НаименованиеПроизводителя = Производитель;
		КонецЦикла;
		
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		
	КонецПопытки;
	
	Excel.WorkBooks.Close();
	Excel = Неопределено;
	
	ПодобратьНоменклатуру();
КонецПроцедуры

&НаСервере
Процедура ПолучитьТаблицуЗначенийИзДиапазонаДанных(ДиапазонДанных, НачальнаяКолонка, КонечнаяКолонка)
	
	КоличествоКолонок = КонечнаяКолонка - НачальнаяКолонка + 1;
	
	ТаблицаДанных = Новый ТаблицаЗначений;
	
	Счетчик = 1;
	
	Пока Счетчик <= КоличествоКолонок Цикл
		ТаблицаДанных.Колонки.Добавить(СтрЗаменить("Колонка_" + Счетчик,Символы.НПП, ""));
		Счетчик = Счетчик + 1;
	КонецЦикла;
	
	ПервыйПрогон = Истина;
	
	Для Каждого МассивТаблицыДанных Из ДиапазонДанных Цикл
		
		Счетчик = 0;
		
		Для Каждого ЗначениеМассива Из МассивТаблицыДанных Цикл
			
			Если ПервыйПрогон Тогда 
				НоваяСтрока = ТаблицаДанных.Добавить();
			Иначе
				НоваяСтрока = ТаблицаДанных[Счетчик];
				Счетчик = Счетчик + 1;
			КонецЕсли;
			
			НомерКолонки = ДиапазонДанных.Найти(МассивТаблицыДанных) + 1;		
			НоваяСтрока.Установить(ТаблицаДанных.Колонки.Индекс(ТаблицаДанных.Колонки.Найти("Колонка_" + НомерКолонки)),ЗначениеМассива); 
			
			
			
		КонецЦикла;
		
		ПервыйПрогон = Ложь;
		
	КонецЦикла;
		
	АдресХранилища = ПоместитьВоВременноеХранилище(ТаблицаДанных);
	
КонецПроцедуры	

&НаСервере
Процедура ПодобратьНоменклатуру()
	ИсходноеКоличество = ТаблицаНоменклатуры.Количество();
	ТЗ = ТаблицаНоменклатуры.Выгрузить();
	ТЗ.Свернуть("Наименование, Производитель, НаименованиеПроизводителя, Описание", "Количество");
	ТаблицаНоменклатуры.Загрузить(ТЗ);
	РезультирующееКоличество = ТаблицаНоменклатуры.Количество();
	КоличествоДублей = ИсходноеКоличество - РезультирующееКоличество;
	Если КоличествоДублей > 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Свернуто дублей: " + Строка(КоличествоДублей));
	КонецЕсли;
	
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.Номенклатура = Справочники.Номенклатура.НайтиПоНаименованию(Строка.Наименование, Истина);
		ЗаполнитьЗначенияСвойств(Строка, Строка.Номенклатура, "ЕдиницаИзмерения, ВидНоменклатуры, Родитель, Производитель");
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Проставить(Команда)
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Строка.ЕдиницаИзмерения = ЕдиницаИзмерения;
		Строка.ВидНоменклатуры = ВидНоменклатуры;
		Строка.Родитель = Родитель;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоздатьНоменклатуруНаСервере()
	Создано = 0;
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		Если ЗначениеЗаполнено(Строка.Номенклатура) Тогда
			Продолжить;
		КонецЕсли;
		
		Попытка
			Номенклатура = Справочники.Номенклатура.СоздатьЭлемент();
			//Номенклатура.ОбменДанными.Загрузка = Истина;
			ЗаполнитьЗначенияСвойств(Номенклатура, Строка, "Наименование, ЕдиницаИзмерения, ВидНоменклатуры, Родитель");
			ЗаполнитьЗначенияСвойств(Номенклатура, Строка.ВидНоменклатуры, "ТипНоменклатуры, ТипНоменклатурыРасширенный");
			Номенклатура.СтавкаНДС = Перечисления.СтавкиНДС.НДС0;
			Номенклатура.НаименованиеПолное = Строка.Наименование;
			Номенклатура.Описание = Строка.Описание;
			
			Производитель = Справочники.Производители.НайтиПоНаименованию(Строка.НаименованиеПроизводителя);
			
			Если Производитель.Пустая() Тогда
				Производитель = СПравочники.Производители.СоздатьЭлемент();
				Производитель.Наименование = Строка.НаименованиеПроизводителя;
				Производитель.Записать();
				Производитель = Производитель.Ссылка;
			КонецЕсли;	
			
			Номенклатура.Производитель = Производитель;
			
			Номенклатура.Записать();
			Создано = Создано + 1;
			Строка.Номенклатура = Номенклатура.Ссылка;
			Строка.Производитель = Номенклатура.Производитель;
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создано номенклатуры: " + Строка(Создано));
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНоменклатуру(Команда)
	СоздатьНоменклатуруНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ДанныеФормы)
	Документ = Документы.ПоступлениеТоваров.СоздатьДокумент();
	Документ.Заполнить(Неопределено);
	ПараметрыУчетаНоменклатуры = Новый ФиксированнаяСтруктура(ЗапасыСервер.ПолучитьПараметрыУчетаНоменклатуры(Документ));
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшированныхЗначений();
	Действия = ОбработкаТабличнойЧастиКлиентСервер;
	Для Каждого Строка Из ТаблицаНоменклатуры Цикл
		НоваяСтрока = Документ.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка, "Номенклатура, ЕдиницаИзмерения");
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка.Номенклатура, "СтавкаНДС");
		НоваяСтрока.Количество = 1;
	КонецЦикла;
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить(Действия.Действие_ЗаполнитьПараметрыУчета(), ПараметрыУчетаНоменклатуры);
	ОбработкаТабличнойЧастиСервер.ОбработатьТабличнуюЧасть(Документ.Товары, СтруктураДействий, КэшированныеЗначения); 
	ЗначениеВДанныеФормы(Документ, ДанныеФормы);
КонецПроцедуры

&НаСервере
Процедура ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере(Идентификатор)
	Строка = ТаблицаНоменклатуры.НайтиПоИдентификатору(Идентификатор);
	ЗаполнитьЗначенияСвойств(Строка, Строка.Номенклатура, "ЕдиницаИзмерения, ВидНоменклатуры, Родитель");	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНоменклатурыНоменклатураПриИзменении(Элемент)
	ТаблицаНоменклатурыНоменклатураПриИзмененииНаСервере(Элементы.ТаблицаНоменклатуры.ТекущиеДанные.ПолучитьИдентификатор());
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	Закрыть(ПолучитьАдресХранилища());
КонецПроцедуры

&НаСервере
Функция ПолучитьАдресХранилища()
	Возврат ПоместитьВоВременноеХранилище(ТаблицаНоменклатуры.Выгрузить(,"Номенклатура, Количество"));
КонецФункции
